# Terraform Plan:
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vpc.aws_ec2_transit_gateway_vpc_attachment.this[0] will be created
  + resource "aws_ec2_transit_gateway_vpc_attachment" "this" {
      + appliance_mode_support                          = "disable"
      + arn                                             = (known after apply)
      + dns_support                                     = "enable"
      + id                                              = (known after apply)
      + ipv6_support                                    = "disable"
      + security_group_referencing_support              = (known after apply)
      + subnet_ids                                      = (known after apply)
      + tags                                            = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tgw-attach-latam-prod"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + tags_all                                        = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "tgw-attach-latam-prod"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + transit_gateway_default_route_table_association = (known after apply)
      + transit_gateway_default_route_table_propagation = (known after apply)
      + transit_gateway_id                              = "tgw-0e6c1db495f9ac32f"
      + vpc_id                                          = (known after apply)
      + vpc_owner_id                                    = (known after apply)
    }

  # module.vpc.aws_route.private_additional["0-0"] will be created
  + resource "aws_route" "private_additional" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = "tgw-0e6c1db495f9ac32f"
    }

  # module.vpc.aws_route.private_additional["1-0"] will be created
  + resource "aws_route" "private_additional" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = "tgw-0e6c1db495f9ac32f"
    }

  # module.vpc.aws_route.private_additional["2-0"] will be created
  + resource "aws_route" "private_additional" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)
      + transit_gateway_id     = "tgw-0e6c1db495f9ac32f"
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1a"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + tags_all         = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1a"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[1] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1b"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + tags_all         = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1b"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[2] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1c"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + tags_all         = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "rt-private-latam-prod-us-east-1c"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[2] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.96.0.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-1"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-1"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.96.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-2"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-2"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[2] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1c"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.96.4.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-3"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + tags_all                                       = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "subnet-private-latam-prod-3"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
          + "Type"        = "private"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.96.0.0/21"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "vpc-latam-noprod"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
      + tags_all                             = {
          + "Environment" = "noprod"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "vpc-latam-noprod"
          + "Project"     = "Latam"
          + "Team"        = "Networking"
        }
    }

Plan: 14 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```